IDENTIFICATION DIVISION.
PROGRAM-ID. REALTIME-TRANSACTION.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 ACCOUNT-BALANCE PIC 9(5) VALUE 1000.
01 TRANSACTION-AMOUNT PIC 9(5).
01 TRANSACTION-TYPE PIC X(1).

PROCEDURE DIVISION.
START-PROGRAM.
    DISPLAY "INITIAL ACCOUNT BALANCE: " ACCOUNT-BALANCE
    PERFORM UNTIL EXIT
        DISPLAY "ENTER TRANSACTION TYPE (D=DEPOSIT, W=WITHDRAW, Q=QUERY, E=EXIT): "
        ACCEPT TRANSACTION-TYPE
        EVALUATE TRANSACTION-TYPE
            WHEN 'D' PERFORM DEPOSIT
            WHEN 'W' PERFORM WITHDRAW
            WHEN 'Q' PERFORM QUERY
            WHEN 'E' EXIT PROGRAM
            WHEN OTHER DISPLAY "INVALID TRANSACTION TYPE"
        END-EVALUATE
    END-PERFORM
    .

DEPOSIT.
    DISPLAY "ENTER AMOUNT TO DEPOSIT: " WITH NO ADVANCING
    ACCEPT TRANSACTION-AMOUNT
    ADD TRANSACTION-AMOUNT TO ACCOUNT-BALANCE
    DISPLAY "NEW ACCOUNT BALANCE: " ACCOUNT-BALANCE
    .

WITHDRAW.
    DISPLAY "ENTER AMOUNT TO WITHDRAW: " WITH NO ADVANCING
    ACCEPT TRANSACTION-AMOUNT
    IF TRANSACTION-AMOUNT > ACCOUNT-BALANCE
        DISPLAY "INSUFFICIENT FUNDS"
    ELSE
        SUBTRACT TRANSACTION-AMOUNT FROM ACCOUNT-BALANCE
        DISPLAY "NEW ACCOUNT BALANCE: " ACCOUNT-BALANCE
    END-IF
    .

QUERY.
    DISPLAY "CURRENT ACCOUNT BALANCE: " ACCOUNT-BALANCE
    .
