IDENTIFICATION DIVISION.
PROGRAM-ID. HelloWorld.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 greeting PIC X(10) VALUE 'Hello, COBOL'.

PROCEDURE DIVISION.
DISPLAY greeting.
STOP RUN.
